---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHandlesData.SetEndHandle(System.Int32)
source: html/e9bfd276-e118-43dc-5980-041898c58654.htm
---
# Autodesk.Revit.DB.Structure.RebarHandlesData.SetEndHandle Method

Sets the end handle tag. This information is set to the rebar after the API execution is finished successfully.

## Syntax (C#)
```csharp
public void SetEndHandle(
	int endHandleTag
)
```

## Parameters
- **endHandleTag** (`System.Int32`) - The tag of the end handle.